# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# Don't forget to add `$(brew --prefix findutils)/libexec/gnubin` to `$PATH`.
brew "findutils"
# Install some other useful utilities like `sponge`
brew "moreutils"
# Install GNU `sed`, overwriting the built-in `sed`
# Don't forget to add `$(brew --prefix gnu-sed)/libexec/gnubin` to `$PATH`.
brew "gnu-sed"
# Install GNU `grep`
# Don't forget to add `$(brew --prefix grep)/libexec/gnubin` to `$PATH`.
brew "grep"

# Install Bash 5
brew "bash"

# Install/Upgrade some languages
brew "python"
brew "go"
brew "coffeescript"

# stow is used to manage these dotfiles
brew "stow"

# Install bash-completion
brew "bash-completion@2"
brew "brew-cask-completion"

# generic colouriser  http://kassiopeia.juls.savba.sk/~garabik/software/grc/
brew "grc"

# Install wget with IRI support
brew "wget"

# Install r
# brew r
# mkdir -p ~/Library/R/3.2/library

# Install more recent versions of some OS X tools
brew "vim"
brew "screen"

# run this script when this file changes guy.
brew "entr"

# find stuff
brew "ack"
brew "fzf"
brew "the_silver_searcher"
brew "z"

# dev stuff
brew "asdf"
brew "autoconf"
brew "automake"
brew "bats-core"
# brew "bfg"
brew "gist"
brew "git"
tap "git-chglog/git-chglog"
brew "git-chglog"
brew "jq"
brew "openssl@1.1"
brew "yamllint"
brew "yq"

# install heroku-cli
# tap "heroku/brew"
# brew "heroku"

# network stuff
brew "grepcidr"
brew "mtr"
brew "mosh"
brew "nmap"
brew "speedtest-cli"

# Install everything else
# brew "aws-elasticbeanstalk"
brew "awscli"
brew "direnv"
# tap "fullscreen/tap"
# brew "aws-rotate-key"
# brew "ffmpeg" --with-libvpx
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "mas"
brew "ncdu"
brew "optipng"
brew "pngcrush"
brew "pngquant"
brew "pv"
# brew "qemu"
brew "rename"
brew "swig"
# brew "travis"
brew "tree"
brew "terminal-notifier"
brew "watch"
brew "whalebrew"

# Install pgp stuff
brew "gpg"
brew "gnupg"
brew "pinentry-mac"

# Install compression stuff
brew "p7zip"
brew "xz"

# Install some linters
brew "shellcheck"

################################
# Casks
################################

# Install native apps

# Link casks in `/Applications` rather than `~/Applications`
# export HOMEBREW_CASK_OPTS="--appdir=/Applications"

# add brew-cask-upgrade
tap "buo/cask-upgrade"

# always
# cask "1password"
cask "1password-beta"
cask "alfred"
cask "barrier"
# cask "docker"
cask "rancher"
# cask "dropbox"
cask "evernote"
cask "firefox"
cask "keybase"
cask "google-chrome"
# cask "google-drive"
# qmk toolbox is in cask-drivers
tap "homebrew/cask-drivers"
cask "qmk-toolbox"
cask "rectangle"
cask "rescuetime"
cask "soundsource"
cask "stay"
cask "the-unarchiver"
cask "transmission"
# cask "xquartz"

# communication
cask "discord"
cask "slack"
cask "zoom"

# development
cask "iterm2"
# cask "menumeters"
# cask "kdiff3"
cask "p4v" # p4merge
cask "sublime-text"
# cask "vagrant"
# cask "vagrant-manager"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "visual-studio-code"
# cask "wireshark"

# multimedia
cask "ears"
# cask "exiftool"
cask "gyazo"
# cask "lastfm"
cask "notunes"
cask "skitch"
cask "spotify"
# cask "vlc"

# quicklook plugins
# cask "betterzipql"
# cask "qlcolorcode"
# cask "qlmarkdown"
# cask "qlprettypatch"
# cask "qlstephen"
# cask "quicklook-csv"
# cask "quicklook-json"
# cask "suspicious-package"

# security
cask "secretive"
cask "tunnelblick"

# utilities
cask "filebot"
cask "krisp"
cask "oversight"
cask "tripmode"
# cask "utm"
cask "yubico-yubikey-manager"

mas 'Wireguard', id: 1451685025
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Clocker', id: 1056643111
mas 'amphetamine', id: 937984704